using System;

namespace Fishbay.Core
{
    public class NewsItem
    {
        public int Id { get; set; }
        public int SectionId { get; set; }
        public ItemState ItemState { get; set; }
        public string Title { get; set; }
        public string UrlLink { get; set; }
        public string TextBody { get; set; }
        public string Author { get; set; }
        public DateTime Created { get; set; }

//        <item>
//			<title>Илья Шестаков провел переговоры с министром рыболовства Республики Корея</title>
//			<link>http://fish.gov.ru/press-tsentr/novosti/21841-ilya-shestakov-provel-peregovory-s-ministrom-rybolovstva-respubliki-koreya</link>
//			<guid isPermaLink = "true" > http://fish.gov.ru/press-tsentr/novosti/21841-ilya-shestakov-provel-peregovory-s-ministrom-rybolovstva-respubliki-koreya</guid>
//			<description><![CDATA[<p><strong>Сеул, 13 марта 2018 года</strong>. – Заместитель министра сельского хозяйства России – руководитель Росрыболовства<strong>Илья Шестаков</strong> провел встречу с министром морских дел и рыболовства Республика Корея Ким Ён Чхуном.Переговоры состоялись в Сеуле в рамках 27-й сессии Российско-Корейской комиссии по рыбному хозяйству 13 марта.&nbsp;</p>
//<p>Ким Ён Чхун подчеркнул важность взаимовыгодного сотрудничества стран в области рыболовства, намерений развивать совместные инвестиционные проекты на территории российского Дальнего Востока и обратил внимание на необходимость скорейшего решения вопроса по выделению участков для их реализации.</p>
//<p>Илья Шестаков поблагодарил за высокий уровень организации работы Комиссии, отметив, что в ходе проходящей сессии стороны обсуждают широкий круг вопросов, прежде всего, практическую реализацию межправительственного Соглашения о сотрудничестве в области предупреждения ННН-промысла.</p>
//<p>Российская сторона выразила обеспокоенность продолжением поставок в корейские порты нелегальной рыбной продукции судами под флагами третьих стран, а также российскими.Для решения проблемы Россия предлагает расширить перечень объектов водных биоресурсов и продукции из них, сопровождаемых сертификатами легальности происхождения по аналогии с поставками краба.</p>
//<p>Руководитель Росрыболовства пригласил Министра морских дел и рыболовства Республика Корея на Петербургский международный экономический форум, в ходе которого пройдет сессия на тему «Инвестиции в рыбохозяйственный комплекс», и Второй Международный рыбопромышленный форум и Выставку рыбной индустрии, морепродуктов и технологий в сентябре в Санкт-Петербурге.</p>
//<p>В тот же день в Посольстве Российской Федерации в Республике Корея состоялась встреча Ильи Шестакова с Чрезвычайным и Полномочным Послом Александром Тимониным, где обсуждался блок вопросов по работе 27-й сессии Российско-Корейской комиссии по рыбному хозяйству, а также статистика по заходам российских судов в южнокорейские порты для выгрузки рыбопродукции.</p>
//<p><strong>Источник</strong>: Пресс-служба Росрыболовства</p>]]></description>
//			<author>pressa @fishcom.ru(Редактор)</author>
//			<category>Новости</category>
//			<pubDate>Tue, 13 Mar 2018 13:46:59 +0000</pubDate>
//		</item>
    }
}